> @d3dfx I tested a OCI remote and this doesn't work yet:
> 
> ```hcl
> provider "incus" {
>   accept_remote_certificate    = true
>   generate_client_certificates = false
> 
>   default_remote = "orb"
> 
>   remote {
>     name = "orb"
>   }
> 
>   remote {
>     name     = "docker"
>     address  = "https://docker.io"
>     protocol = "oci"
>     public   = true
>   }
> }
> 
> resource "incus_instance" "oci_1" {
>   name  = "oci-1"
>   image = "docker:alpine"
> }
> ```
> 
> ```shell
> incus-tf-provider-tests tofu apply
> ╷
> │ Warning: Provider development overrides are in effect
> │ 
> │ The following provider development overrides are set in the CLI configuration:
> │  - lxc/incus in /Users/maveonair/Code/github.com/maveonair/terraform-provider-incus
> │ 
> │ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
> ╵
> 
> OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
>   + create
> 
> OpenTofu will perform the following actions:
> 
>   # incus_instance.oci_1 will be created
>   + resource "incus_instance" "oci_1" {
>       + architecture = (known after apply)
>       + config       = {}
>       + ephemeral    = false
>       + image        = "docker:alpine"
>       + ipv4_address = (known after apply)
>       + ipv6_address = (known after apply)
>       + mac_address  = (known after apply)
>       + name         = "oci-1"
>       + profiles     = [
>           + "default",
>         ]
>       + running      = true
>       + status       = (known after apply)
>       + target       = (known after apply)
>       + type         = "container"
>     }
> 
> Plan: 1 to add, 0 to change, 0 to destroy.
> 
> Do you want to perform these actions?
>   OpenTofu will perform the actions described above.
>   Only 'yes' will be accepted to approve.
> 
>   Enter a value: yes
> 
> incus_instance.oci_1: Creating...
> ╷
> │ Error: Failed to retrieve Incus ImageServer
> │ 
> │   with incus_instance.oci_1,
> │   on pr-254.tf line 6, in resource "incus_instance" "oci_1":
> │    6: resource "incus_instance" "oci_1" {
> │ 
> │ Unable to create server client for remote "docker": Failed to fetch https://www.docker.com/1.0: 404 Not Found
> ```
> 
> When I remove the `remote` block for `docker` and use the one I have configured with the Incus CLI then it works as expected:
> 
> ```shell
> ➜  incus-tf-provider-tests incus remote ls
> +---------------+------------------------------------+---------------+-------------+--------+--------+--------+
> |     NAME      |                URL                 |   PROTOCOL    |  AUTH TYPE  | PUBLIC | STATIC | GLOBAL |
> +---------------+------------------------------------+---------------+-------------+--------+--------+--------+
> +---------------+------------------------------------+---------------+-------------+--------+--------+--------+
> | docker        | https://docker.io                  | oci           | none        | YES    | NO     | NO     |
> +---------------+------------------------------------+---------------+-------------+--------+--------+--------+
> | images        | https://images.linuxcontainers.org | simplestreams | none        | YES    | NO     | NO     |
> +---------------+------------------------------------+---------------+-------------+--------+--------+--------+
> | local         | unix://                            | incus         | file access | NO     | YES    | NO     |
> +---------------+------------------------------------+---------------+-------------+--------+--------+--------+
> +---------------+------------------------------------+---------------+-------------+--------+--------+--------+
> | orb (current) | https://ubuntu.orb.local:8443      | incus         | tls         | NO     | NO     | NO     |
> +---------------+------------------------------------+---------------+-------------+--------+--------+--------+
> ```

I fixed error that prevented it from deploying but the provider is still not adding the docker remote to `incus remote ls`. I will continue to work through this!